In [2]:
import pandas as pd 
# 读取学生信息表
df_grade = pd.read_excel('./course_datas/c23_excel_vlookup/学生成绩表.xlsx')

In [3]:
df_grade.head()

    班级    学号  语文成绩  数学成绩  英语成绩
0  C01  S001    99    84    88
1  C01  S002    66    95    77
2  C01  S003    68    68    61
3  C01  S004    63    66    82
4  C01  S005    72    95    94

In [4]:
# 读取学生成绩表
df_sinfo = pd.read_excel('./course_datas/c23_excel_vlookup/学生信息表.xlsx')

In [5]:
df_sinfo.head()

     学号  姓名 性别  年龄  籍贯
0  S001  怠涵  女  23  山东
1  S002  婉清  女  25  河南
2  S003  溪榕  女  23  湖北
3  S004  漠涓  女  19  陕西
4  S005  祈博  女  24  山东

In [6]:
df_sinfo = df_sinfo[['学号', '姓名', '性别']]
df_sinfo.head()

     学号  姓名 性别
0  S001  怠涵  女
1  S002  婉清  女
2  S003  溪榕  女
3  S004  漠涓  女
4  S005  祈博  女

In [24]:
df_merge = pd.merge(left = df_grade, right = df_sinfo, left_on = '学号', right_on = '学号')
df_merge.head()

    班级    学号  语文成绩  数学成绩  英语成绩  姓名 性别
0  C01  S001    99    84    88  怠涵  女
1  C01  S002    66    95    77  婉清  女
2  C01  S003    68    68    61  溪榕  女
3  C01  S004    63    66    82  漠涓  女
4  C01  S005    72    95    94  祈博  女

# 如何调整列表的顺序？

In [25]:
new_columns = df_merge.columns.to_list()

In [26]:
new_columns

['班级', '学号', '语文成绩', '数学成绩', '英语成绩', '姓名', '性别']

## 把'姓名'、'性别'两列放在'学号'的后面

In [27]:
for name in ['姓名', '性别'][::-1]:
    new_columns.remove(name)
    new_columns.insert(new_columns.index('学号')+1, name)

In [28]:
new_columns

['班级', '学号', '姓名', '性别', '语文成绩', '数学成绩', '英语成绩']

In [29]:
df_merge.head()

    班级    学号  语文成绩  数学成绩  英语成绩  姓名 性别
0  C01  S001    99    84    88  怠涵  女
1  C01  S002    66    95    77  婉清  女
2  C01  S003    68    68    61  溪榕  女
3  C01  S004    63    66    82  漠涓  女
4  C01  S005    72    95    94  祈博  女

In [30]:
df_merge = df_merge.reindex(columns = new_columns)

In [31]:
df_merge.head()

    班级    学号  姓名 性别  语文成绩  数学成绩  英语成绩
0  C01  S001  怠涵  女    99    84    88
1  C01  S002  婉清  女    66    95    77
2  C01  S003  溪榕  女    68    68    61
3  C01  S004  漠涓  女    63    66    82
4  C01  S005  祈博  女    72    95    94